RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
        <register>
          <name>CLUT_LOAD</name>
          <description>Clut Load Control Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x8000007F</resetMask>
          <fields>
            <field>
              <name>STR_HIGH</name>
              <description>1'b1: Store 8+ CLUT tables through APB
1'b0: Store 0-7 CLUT tables through APB</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_NUM</name>
              <description>Selected CLUT Number
The SEL_CLUT_NUM is used to select which plane's CLUT need to be updated. The hardware can only backup one CLUT setting and load, so the SEL_CLUT_NUM can't be changed when CLUT_LOAD[UPDATE_EN] is 1.
. 3'h0 - PLANE 0
. 3'h1 - PLANE 1
. ------
. 3'h7 - PLANE 7
CLUT 8 can be modified via APB even when display is on.
Currently CLUT for plane 0..7 cannot be modified via APB when display is on.  Can only be updated via CLUT_LOAD[UPDATE_EN] bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE_EN</name>
              <description>CLUT Update Enable
The bit is written to 1 when software want to update the Color Look Up Tables during display.
If set to 1, software update selected CLUT due to SEL_CLUT_NUM setting, the table will be copied from CLUT8 during vertical blanking period after SHADOW_LOAD_EN is set to 1.
If set to 0, software can update CLUT8 directly according to the CLUT memory map.
Hardware will automatically clear this bit when selected CLUT is updated according to SEL_CLUT_NUM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="LCDC">
      <name>LCDC1</name>
      <description>LCDC1</description>
      <groupName>LCDC</groupName>
      <baseAddress>0xf1004000</baseAddress>
    </peripheral>
    <peripheral>
      <name>CAM0</name>
      <description>CAM0</description>
      <groupName>CAM</groupName>
      <baseAddress>0xf1008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4b0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF9AAFFF</resetMask>
          <fields>
            <field>
              <name>INV_DEN</name>
              <description>invert den pad input before it is used</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOR_EXT</name>
              <description>If asserted, will change the output color to ARGB8888 mode. Used by input color as RGB565, RGB888, YUV888, etc.
The byte sequence is B,G,R,A. Depends on correct CR2[ClrBitFormat] configuration.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_PIXCLK</name>
              <description>invert pixclk pad input before it is used</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_HSYNC</name>
              <description>invert hsync pad input before it is used</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_VSYNC</name>
              <description>invert vsync pad input before it is used</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP16_EN</name>
              <description>SWAP 16-Bit Enable. This bit enables the swapping of 16-bit data. Data is packed from 8-bit or 10-bit to 32-bit first (according to the setting of PACK_DIR) and then swapped as 16-bit words before being put into the RX FIFO. The action of the bit only affects the RX FIFO.
NOTE: Example of swapping enabled:
Data input to FIFO = 0x11223344
Data in RX FIFO = 0x 33441122
NOTE: Example of swapping disabled:
Data input to FIFO = 0x11223344
Data in RX FIFO = 0x11223344
0 Disable swapping
1 Enable swapping</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PACK_DIR</name>
              <description>Data Packing Direction. This bit Controls how 8-bit/10-bit image data is packed into 32-bit RX FIFO.
0 Pack from LSB first. For image data, 0x11, 0x22, 0x33, 0x44, it will appear as 0x44332211 in RX FIFO.
1 Pack from MSB first. For image data, 0x11, 0x22, 0x33, 0x44, it will appear as 0x11223344 in RX FIFO.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESTART_BUSPTR</name>
              <description>force to restart the bus pointer at the every end of the sof period, and at the same time, clr the fifo pointer</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASYNC_RXFIFO_CLR</name>
              <description>ASynchronous Rx FIFO Clear.
When asserted, this bit clears RXFIFO immediately.
It will be auto-cleared.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_RXFIFO_CLR</name>
              <description>Synchronous Rx FIFO Clear.
When asserted, this bit clears RXFIFO on every SOF.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOF_INT_POL</name>
              <description>SOF Interrupt Polarity. This bit controls the condition that generates an SOF interrupt.
0 SOF interrupt is generated on SOF falling edge
1 SOF interrupt is generated on SOF rising edge</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_DATA</name>
              <description>Invert Data Input. This bit enables or disables internal inverters on the data lines.
0 CAM_D data lines are directly applied to internal circuitry
1 CAM_D data lines are inverted before applied to internal circuitry</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STORAGE_MODE</name>
              <description>00: Normal Mode (one plane mode)
01: Two Plane Mode (Y, UV plane)
10: Y-only Mode, byte sequence as Y0,Y1,Y2,Y3
11: Binary Mode, bit sequence is from LSB to MSB when CR20[BIG_END]=0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOR_FORMATS</name>
              <description>input color formats:
0010b:24bit:RGB888
0011b:24bit:RGB666
0100b:16bit:RGB565
0101b:16bit:RGB444
0110b:16bit:RGB555
0111b: 16bit: YCbCr422 (Y0 Cb Y1 Cr, each 8-bit)
YUV
YCrCb
Note: YUV420 is not supported.
1000b: 24bit: YUV444</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SENSOR_BIT_WIDTH</name>
              <description>the bit width of the sensor
0: 8 bits
1: 10 bits
3:24bits
Others: Undefined</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF5F</resetMask>
          <fields>
            <field>
              <name>ERR_CL_BWID_CFG_INT_EN</name>
              <description>The unsupported color (color_formats[3:0]) and bitwidth (sensor_bit_width[2:0]) configuation interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_DONE_INT_EN</name>
              <description>Enable hist done int</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HRESP_ERR_EN</name>
              <description>Hresponse Error Enable. This bit enables the hresponse error interrupt.
0 Disable hresponse error interrupt
1 Enable hresponse error interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOF_INT_EN</name>
              <description>End-of-Frame Interrupt Enable. This bit enables and disables the EOF interrupt.
0 EOF interrupt is disabled.
1 EOF interrupt is generated when RX count value is reached.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_OR_INTEN</name>
              <description>RxFIFO Overrun Interrupt Enable. This bit enables the RX FIFO overrun interrupt.
0 RxFIFO overrun interrupt is disabled
1 RxFIFO overrun interrupt is enabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FB2_DMA_DONE_INTEN</name>
              <description>Frame Buffer2 DMA Transfer Done Interrupt Enable. This bit enables the interrupt of Frame Buffer2 DMA
transfer done.
0 Frame Buffer2 DMA Transfer Done interrupt disable
1 Frame Buffer2 DMA Transfer Done interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FB1_DMA_DONE_INTEN</name>
              <description>Frame Buffer1 DMA Transfer Done Interrupt Enable. This bit enables the interrupt of Frame Buffer1 DMA
transfer done.
0 Frame Buffer1 DMA Transfer Done interrupt disable
1 Frame Buffer1 DMA Transfer Done interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOF_INT_EN</name>
              <description>Start Of Frame (SOF) Interrupt Enable. This bit enables the SOF interrupt.
0 SOF interrupt disable
1 SOF interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control 2 Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF8FEF</resetMask>
          <fields>
            <field>
              <name>FRMCNT_15_0</name>
              <description>Frame Counter. This is a 16-bit Frame Counter
(Wraps around automatically after reaching the maximum)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRMCNT_RST</name>
              <description>Frame Count Reset. Resets the Frame Counter.
0 Do not reset
1 Reset frame counter immediately</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFF_LEVEL</name>
              <description>RxFIFO Full Level. When the number of data in RxFIFO reaches this level, a RxFIFO full interrupt is generated, or an RXFIFO DMA request is sent.
000 4 Double words
001 8 Double words
010 16 Double words
011 24 Double words
100 32 Double words
101 48 Double words
110 64 Double words
111 96 Double words</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_REQ_EN_RFF</name>
              <description>DMA Request Enable for RxFIFO. This bit enables the dma request from RxFIFO to the embedded DMA controller.
0 Disable the dma request
1 Enable the dma request. The UV Rx FIFO is only enabled to filling data in 2 plane mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRBITFORMAT</name>
              <description>Input Byte &amp; bit sequence same as OV5640, except for Raw mode. Used only for internal ARGB conversion.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STA</name>
          <description>Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFA7FC</resetMask>
          <fields>
            <field>
              <name>ERR_CL_BWID_CFG</name>
              <description>The unsupported color (color_formats[3:0]) and bitwidth (sensor_bit_width[2:0]) configuation found</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HIST_DONE</name>
              <description>hist cal done</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RF_OR_INT</name>
              <description>RxFIFO Overrun Interrupt Status. Indicates the overflow status of the RxFIFO register. (Cleared by writing
1)
0 RXFIFO has not overflowed.
1 RXFIFO has overflowed.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA_TSF_DONE_FB2</name>
              <description>DMA Transfer Done in Frame Buffer2. Indicates that the DMA transfer from RxFIFO to Frame Buffer2 is completed. It can trigger an interrupt if the corresponding enable bit is set in CAM_CR1. This bit can be cleared by by writing 1 or reflashing the RxFIFO dma controller in CAM_CR3. (Cleared by writing 1)
0 DMA transfer is not completed.
1 DMA transfer is completed.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA_TSF_DONE_FB1</name>
              <description>DMA Transfer Done in Frame Buffer1. Indicates that the DMA transfer from RxFIFO to Frame Buffer1 is completed. It can trigger an interrupt if the corresponding enable bit is set in CAM_CR1. This bit can be cleared by by writing 1 or reflashing the RxFIFO dma controller in CAM_CR3. (Cleared by writing 1)
0 DMA transfer is not completed.
1 DMA transfer is completed.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EOF_INT</name>
              <description>End of Frame (EOF) Interrupt Status. Indicates when EOF is detected. (Cleared by writing 1)
0 EOF is not detected.
1 EOF is detected.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SOF_INT</name>
              <description>Start of Frame Interrupt Status. Indicates when SOF is detected. (Cleared by writing 1)
0 SOF is not detected.
1 SOF is detected.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HRESP_ERR_INT</name>
              <description>Hresponse Error Interrupt Status. Indicates that a hresponse error has been detected. (Cleared by writing
1)
0 No hresponse error.
1 Hresponse error is detected.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASA_FB1</name>
          <description>Pixel DMA Frame Buffer 1 Address</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTR</name>
              <description>DMA Start Address in Frame Buffer1. Indicates the start address to write data. The embedded DMA controller will read data from RxFIFO and write it from this address through AHB bus. The address should be double words aligned.
In Two-Plane Mode, Y buffer1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASA_FB2</name>
          <description>Pixel DMA Frame Buffer 2 Address</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTR</name>
              <description>DMA Start Address in Frame Buffer2. Indicates the start address to write data. The embedded DMA controller will read data from RxFIFO and write it from this address through AHB bus. The address should be double words aligned.
In Two-Plane Mode, Y buffer2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF_PARA</name>
          <description>Buffer Parameters Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINEBSP_STRIDE</name>
              <description>Line Blank Space Stride. Indicates the space between the end of line image storage and the start of a new line storage in the frame buffer.
The width of the line storage in frame buffer(in double words) minus the width of the image(in double words) is the stride. The stride should be double words aligned. The embedded DMA controller will skip the stride before starting to write the next row of the image.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDEAL_WN_SIZE</name>
          <description>Ideal Image Size Register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HEIGHT</name>
              <description>Image Height. Indicates how many active pixels in a column of the image from the sensor.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIDTH</name>
              <description>Image Width. Indicates how many active pixels in a line of the image from the sensor.
The number of bytes to be transferred is re-calculated automatically in hardware based on cr1[color_ext] and cr1[store_mode]. Default value is 2*pixel number.
As the input data from the sensor is 8-bit/pixel format, the IMAGE_WIDTH should be a multiple of 8 pixels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR18</name>
          <description>Control CR18 Register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFE7BF</resetMask>
          <fields>
            <field>
              <name>AWQOS</name>
              <description>AWQOS for bus fabric arbitration</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASA_UV1</name>
          <description>Pixel UV DMA Frame Buffer 1 Address</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTR</name>
              <description>Two Plane UV Buffer Start Address 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
