RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>GWC0</name>
      <description>GWC0</description>
      <groupName>GWC</groupName>
      <baseAddress>0xf1018000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1f0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>glb_ctrl</name>
          <description>control reg</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000081</resetMask>
          <fields>
            <field>
              <name>CLK_POL</name>
              <description>graphic clock polarity.
set to invert input graphic clock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GWC_EN</name>
              <description>graphic window check enable.
set to enable the whole block</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_mask</name>
          <description>interrupt enable</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000B</resetMask>
          <fields>
            <field>
              <name>MASK_RREEZ</name>
              <description>freeze mask, set to disable changing ERR_MASK and FUNC_MASK.
can only be cleared by system reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_MASK</name>
              <description>function interrupt mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_MASK</name>
              <description>error interrupt mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>irq_sts</name>
          <description>interrupt status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>FUNC_STS</name>
              <description>function interrupt status.
it's set when detect two VSYNC signals after the block is enabled(GWC_EN is set)
software write 1 to clear.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_STS</name>
              <description>error status, it's OR of GWC_FAIL_STS[15:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GWC_FAIL_STS</name>
              <description>graphic window check fail interrupt status.
will be set if the calculated CRC not equal reference CRC.
one bit for each channel.
software write 1 to clear.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0xf0</dimIncrement>
          <dimIndex>ch0,ch15</dimIndex>
          <name>CHANNEL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x10</addressOffset>
          <register>
            <name>cfg0</name>
            <description>config reg 0</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xCFFF1FFF</resetMask>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>channel enable</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FREEZE</name>
                <description>freeze config. set to freeze all other config registers for current channel.
can only be cleared by system reset</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>START_ROW</name>
                <description>define the window start row number</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>START_COL</name>
                <description>define the window start column number</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>cfg1</name>
            <description>config reg 1</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0FFF1FFF</resetMask>
            <fields>
              <field>
                <name>END_ROW</name>
                <description>define the window end row number</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>END_COL</name>
                <description>define the window end column number</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>refcrc</name>
            <description>reference CRC</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REF_CRC</name>
                <description>reference CRC
polynomial function:  0x104C11DB7</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>calcrc</name>
            <description>calculated CRC</description>
            <addressOffset>0xc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CAL_CRC</name>
                <description>calculated CRC for last frame</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
