RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
        <register>
          <name>CMD_MODE_CFG</name>
          <description>This register configures several aspect of command mode operation, tearing effect, acknowledge for each packet and the speed mode to transmit each Data Type related to commands.</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x010F7F03</resetMask>
          <fields>
            <field>
              <name>MAX_RD_PKT_SIZE</name>
              <description>This bit configures the maximum read packet size command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCS_LW_TX</name>
              <description>This bit configures the DCS long write packet command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCS_SR_0P_TX</name>
              <description>This bit configures the DCS short read packet with zero parameter command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCS_SW_1P_TX</name>
              <description>This bit configures the DCS short write packet with one parameter command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCS_SW_0P_TX</name>
              <description>This bit configures the DCS short write packet with zero parameter command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_LW_TX</name>
              <description>This bit configures the Generic long write packet command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_SR_2P_TX</name>
              <description>This bit configures the Generic short read packet with two parameters command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_SR_1P_TX</name>
              <description>This bit configures the Generic short read packet with two parameters command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_SR_0P_TX</name>
              <description>This bit configures the Generic short read packet with two parameters command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_SW_2P_TX</name>
              <description>This bit configures the Generic short read packet with two parameters command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_SW_1P_TX</name>
              <description>This bit configures the Generic short read packet with two parameters command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_SW_0P_TX</name>
              <description>This bit configures the Generic short read packet with two parameters command transmission type:
0x0 (HIGHSPEED): Transition type is High Speed
0x1 (LOWPOWER): Transition type is Low Power</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACK_RQST_EN</name>
              <description>When set to 1, this bit enables the acknowledge request after each packet transmission.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEAR_FX_EN</name>
              <description>When set to 1, this bit enables the tearing effect acknowledge request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gen_hdr</name>
          <description>sets the header for new packets sent using the generic interface</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_WC_MSBYTE</name>
              <description>configures the most significant byte of the header packet's word count for long packets or data 1 for shout packets</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_WC_LSBYTE</name>
              <description>configures the least significant byte of the header packet's word count for long packets or data0 for short packets</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_VC</name>
              <description>configures the virtual channel ID of the header packet</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_DT</name>
              <description>configures the packet data type of the header packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gen_pld_data</name>
          <description>sets the payload for packets sent using the generic interface</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEN_PLD_B4</name>
              <description>indicates byte4 of the packet payload</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_PLD_B3</name>
              <description>indicates byte3 of the packet payload</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_PLD_B2</name>
              <description>indicates byte2 of the packet payload</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_PLD_B1</name>
              <description>indicates byte1 of the packet payload</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cmd_pkt_status</name>
          <description>information about the status of FIFOs related to DBI and Generic interface</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F007F</resetMask>
          <fields>
            <field>
              <name>GEN_BUFF_PLD_FULL</name>
              <description>the full status of the generic payload internal buffer</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_BUFF_PLD_EMPTY</name>
              <description>the empty status of the generic payload internal buffer</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_BUFF_CMD_FULL</name>
              <description>the full status of the generic command internal buffer</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_BUFF_CMD_EMPTY</name>
              <description>the empty status of the generic command internal buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_RD_CMD_BUSY</name>
              <description>indicates a read command is issued and the entire response is not sotred in the FIFO</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_PLD_R_FULL</name>
              <description>indicates the full status of the generic read payoad FIFO</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_PLD_R_EMPTY</name>
              <description>indicates the empty status of the generic read payload FIFO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_PLD_W_FULL</name>
              <description>indicates the full status of the generic write payload FIFO</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_PLD_W_EMPTY</name>
              <description>indicates the empty status of the generic write payload FIFO</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_CMD_FULL</name>
              <description>indicates the full status of the generic command FIFO</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_CMD_EMPTY</name>
              <description>indicates the empty status of the generic command FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>to_cnt_cfg</name>
          <description>configures the trigger timeout errors</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTX_TO_CNT</name>
              <description>configures the timeout counter that triggers a high speed transmission timeout contention detection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPRX_TO_CNT</name>
              <description>configures the timeout counter that triggers a low power reception timeout contention detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>hs_rd_to_cnt</name>
          <description>configures the peripheral response timeout after high speed read operations</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>HS_RD_TO_CNT</name>
              <description>sets a period for which DWC_mipi_dsi_host keeps the link still after sending a high speed read operation;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>lp_rd_to_cnt</name>
          <description>configures the peripheral response timeout after low-power read operation</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LP_RD_TO_CNT</name>
              <description>sets a period for which dwc_mipi_dsi_host keeps the link still after sending a low power read operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>hs_wr_to_cnt</name>
          <description>configures the peripheral response timeout after high speed write operations</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>HS_WR_TO_CNT</name>
              <description>sets the period for which dwc_mipi_dsi_host keeps the link still after sending a high speed write operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>lp_wr_to_cnt</name>
          <description>configures the peripheral response timeout after low power write operations</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LP_WR_TO_CNT</name>
              <description>sets the period for which dsi host keeps the link still after sending a low power write operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>bta_to_cnt</name>
          <description>configures the periphera response timeout after bus turnaround</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>BTA_TO_CNT</name>
              <description>sets the period for which dsi host keeps the link still after completing a bus turnaround.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sdf_3d</name>
          <description>sotres 3d control information for vss packets in video mode</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001003F</resetMask>
          <fields>
            <field>
              <name>SEND_3D_CFG</name>
              <description>set the next vss packet to include 3d control payload in every vss packet</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RIGHT_FIRST</name>
              <description>0x0: left eye is sent first
0x1:right eye is sent first</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECOND_VSYNC</name>
              <description>defines whether there is a second VSYNC pulse</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORMAT_3D</name>
              <description>defines 3D image format</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE_3D</name>
              <description>defines 3D mode on/off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>lpclk_ctrl</name>
          <description>configures the possibility for using non continuous clock in the clock lane</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>AUTO_CLKLANE_CTRL</name>
              <description>enables the automatic mechanism to stop providing clock in the clock lane</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_TXREQUESTCLKHS</name>
              <description>controls the D-PHY PPI txrequestclkhs signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_tmr_lpclk_cfg</name>
          <description>sets the time that dsi host assumes in calculations for the clock lane to switch between high-speed and low-power</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF03FF</resetMask>
          <fields>
            <field>
              <name>PHY_CLKHS2LP_TIME</name>
              <description>configures the maximum time that the d-phy clock lane takes to go from high-speed to low-power transmission</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_CLKLP2HS_TIME</name>
              <description>configures the maximum time that the d-phy clock lane takes to go from low-power to high-speed transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_tmr_cfg</name>
          <description>sets the time that dsi host assumes in calculations for data lanes to switch between hs to lp</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF03FF</resetMask>
          <fields>
            <field>
              <name>PHY_HS2LP_TIME</name>
              <description>This field configures the maximum time that the D-PHY data
lanes take to go from high-speed to low-power transmission
measured in lane byte clock cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP2HS_TIME</name>
              <description>This field configures the maximum time that the D-PHY data
lanes take to go from low-power to high-speed transmission
measured in lane byte clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
