RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
        <register>
          <name>int_force1</name>
          <description>forces interrupts that affect the int_st1 register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00181FFF</resetMask>
          <fields>
            <field>
              <name>FORCE_TEAR_REQUEST_ERR</name>
              <description>force tear_request has occurred but tear effect is not active in dsi host and device</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_DPI_BUFF_PLD_UNDER</name>
              <description>force an underflow when reading payload to build dsi packet for video mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_GEN_PLD_RECEV_ERR</name>
              <description>force that during a generic interface packet read back, the payload FIFO full</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_GEN_PLD_RD_ERR</name>
              <description>force that during a DCS read data, the payload FIFO becomes empty</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_GEN_PLD_SEND_ERR</name>
              <description>force the payload FIFO become empty when packet build</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_GEN_PLD_WR_ERR</name>
              <description>force the system tried to write a payload and FIFO is full</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_GEN_CMD_WR_ERR</name>
              <description>force the system tried to write a command and FIFO is full</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_DPI_BPLD_WR_ERR</name>
              <description>force the payload FIFO is full during a DPI pixel line storage</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_EOPT_ERR</name>
              <description>force that the EoTp packet has not been received at the end of the incoming peripheral transmission</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PKT_SIZE_ERR</name>
              <description>force that the packet size error has been detected during the packet reception</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_CRC_ERR</name>
              <description>force that the CRC error has been detected in the reveived packet payload</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ECC_MULTI_ERR</name>
              <description>force that the ECC multiple error has been detected in a revieved packet</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ECC_SIGLE_ERR</name>
              <description>force that the ECC single error has been detected and corrected in a reveived packet</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_TO_LP_TX</name>
              <description>force that the low-power reception timeout counter reached the end and contention has been detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_TO_HS_TX</name>
              <description>force that the high-speed transmission timeout counter reached the end and contention has been detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_tmr_rd</name>
          <description>configures times related to PHY to perform some operations in lane byte clock cycle</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <fields>
            <field>
              <name>MAX_RD_TIME</name>
              <description>the maximum time required to perform a read command in lane byte clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>auto_ulps_min_time</name>
          <description>configures the minimum time required by phy between ulpsactivenot and ulpsexitreq for clock and data lane</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>ULPS_MIN_TIME</name>
              <description>configures the minimum time required by phy between ulpsactivenot and ulpsexitreq for clock and data lane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_mode</name>
          <description>select phy mode</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>PHY_MODE</name>
              <description>sel DPHY or CPHY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_shadow_ctrl</name>
          <description>controls dpi shadow feature</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00010101</resetMask>
          <fields>
            <field>
              <name>VID_SHADOW_PIN_REQ</name>
              <description>when set to 1, the video request is done by external pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VID_SHADOW_REQ</name>
              <description>when set to 1, request that the dpi register from regbank are copied to the auxiliary registers</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VID_SHADOW_EN</name>
              <description>when set to 1, DPI receives the active configuration from the auxiliary register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dpi_vcid_act</name>
          <description>holds the value that controller is using for DPI_VCID</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>DPI_VCID</name>
              <description>specifies the DPI virtual channel id that is indexed to the video mode packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dpi_color_coding_act</name>
          <description>holds the value that controller is using for DPI_COLOR_CODING</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000010F</resetMask>
          <fields>
            <field>
              <name>LOOSELY18_EN</name>
              <description>avtivates loosely packed variant to 18-bit configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIP_COLOR_CODING</name>
              <description>configures the DPI color for video mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dpi_lp_cmd_tim_act</name>
          <description>holds value that controller is using for dpi_lp_cmd_time</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <fields>
            <field>
              <name>OUTVACT_LPCMD_TIME</name>
              <description>transmission of commands in low-power mode, it specifies the size in bytes of the lagest packet that can fit in a line during the VSA VBP and VFP regions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INVACT_LPCMD_TIME</name>
              <description>transmission of commands in low-power mode, it specifies the size in bytes of the lagest packet that can fit in a line during the vact regions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_mode_cfg_act</name>
          <description>holds value that controller is using for vid_mode_cfg</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>LP_CMD_EN</name>
              <description>enable the command transmission only in low-power mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAME_BTA_ACK_EN</name>
              <description>enable the request for an acknowledge response at the end of a frame</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_HFP_EN</name>
              <description>enable the returne to low-power inside the HFP period when timing allows</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_HBP_EN</name>
              <description>enable the returne to low-power inside the HBP period when timing allows</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_VACT_EN</name>
              <description>enable the returne to low-power inside the VACT period when timing allows</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_VFP_EN</name>
              <description>enable the returne to low-power inside the VFP period when timing allows</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_VBP_EN</name>
              <description>enable the returne to low-power inside the VBP period when timing allows</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_VSA_EN</name>
              <description>enable the returne to low-power inside the VSA period when timing allows</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VID_MODE_TYPE</name>
              <description>specifies the video mode transmission type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_pkt_size_act</name>
          <description>holds value that controller is using for vid_pkt_size</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>VID_PKT_SIZE</name>
              <description>the number of pixels in a single video packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_num_chunks_act</name>
          <description>holds value that controller is using for vid_num_chunks</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>VID_NUM_CHUNKS</name>
              <description>the number of chunks to be transmitted during a line period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_null_size_act</name>
          <description>holds the value that controller is using for vid_null_size</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>VID_NULL_SIZE</name>
              <description>the number of bytes in side a null packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_hsa_time_act</name>
          <description>the value of vid_hsa_time</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>VID_HSA_TIME</name>
              <description>the horizontal synchronism active period in lane byte clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_hbp_time_act</name>
          <description>the value that controller is using for vid_hbp_time</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>VID_HBP_TIME</name>
              <description>the horizontal back porch period in lane byte clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_hline_time_act</name>
          <description>the value for vid_hline_time</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <fields>
            <field>
              <name>VID_HLINE_TIME</name>
              <description>the size of total line: hsa+hbp+hact+hfp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_vsa_lines_act</name>
          <description>value for vid_vsa_lines</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>VSA_LINES</name>
              <description>vertical synchronism active period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_vbp_lines_act</name>
          <description>value for vid_vbp_lines</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>VBP_LINES</name>
              <description>vertical back porch period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_vfp_lines_act</name>
          <description>value for vid_vfp_lines</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>VFP_LINES</name>
              <description>vertical porch period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_vactive_lines_act</name>
          <description>value for vid_vactive_lines</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>V_ACTIVE_LINES</name>
              <description>vertical active period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vid_pkt_status</name>
          <description>status of fifo related to dpi</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003000F</resetMask>
          <fields>
            <field>
              <name>DPI_BUFF_PLD_FULL</name>
              <description>This bit indicates the full status of the payload internal buffer
for video Mode. This bit is set to 0 for command Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPI_BUFF_PLD_EMPTY</name>
              <description>This bit indicates the empty status of the payload internal
buffer for video Mode. This bit is set to 0 for command Mod</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPI_PLD_W_FULL</name>
              <description>This bit indicates the full status of write payload FIFO for
video Mode. This bit is set to 0 for command Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPI_PLD_W_EMPTY</name>
              <description>This bit indicates the empty status of write payload FIFO for
video Mode. This bit is set to 0 for command Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPI_CMD_W_FULL</name>
              <description>This bit indicates the full status of write command FIFO for
video Mode. This bit is set to 0 for command Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPI_CMD_W_EMPTY</name>
              <description>This bit indicates the empty status of write command FIFO
for video Mode. This bit is set to 0 for command Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
