RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PIXEL_MUX</name>
      <description>PIXEL_MUX</description>
      <groupName>PIXELMUX</groupName>
      <baseAddress>0xf1034000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PIXMUX</name>
          <description>pixel path mux register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF00FF</resetMask>
          <fields>
            <field>
              <name>RGB_EN</name>
              <description>RGB pixel bus enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGB_SEL</name>
              <description>RGB pixel bus selection
1: LCDC1
0: LCDC0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GWC1_EN</name>
              <description>GWC1 pixel bus enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GWC1_SEL</name>
              <description>GWC1 pixel bus selection
1: LCDC1
0: LCDC0</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GWC0_EN</name>
              <description>GWC0 pixel bus enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GWC0_SEL</name>
              <description>GWC0 pixel bus selection
1: LCDC1
0: LCDC0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVB_DI1_EN</name>
              <description>LVB DI1 pixel bus enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVB_DI1_SEL</name>
              <description>LVB DI1 pixel bus selection
1: LCDC1
0: LCDC0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVB_DI0_EN</name>
              <description>LVB DI0 pixel bus enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVB_DI0_SEL</name>
              <description>LVB DI0 pixel bus selection
1: LCDC1
0: LCDC0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI1_EN</name>
              <description>DSI0 pixel bus enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI1_SEL</name>
              <description>DSI0 pixel bus selection
1: LCDC1
0: LCDC0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI0_EN</name>
              <description>DSI1 pixel bus enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI0_SEL</name>
              <description>DSI1 pixel bus selection
1: LCDC1
0: LCDC0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM1_EN</name>
              <description>CAM1 pixel bus enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM1_SEL</name>
              <description>CAM1 pixel bus selection
111: Reserved
110: LCB1
101: LCB0
100: LCDC1
011: LCDC0
010: CSI1
001: CSI0
000: DVP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM0_EN</name>
              <description>CAM0 pixel bus enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM0_SEL</name>
              <description>CAM0 pixel bus selection
111: Reserved
110: LCB1
101: LCB0
100: LCDC1
011: LCDC0
010: CSI1
001: CSI0
000: DVP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>DSI0_CFG,DSI1_CFG</dimIndex>
          <name>DSI_SETTING[%s]</name>
          <description>no description available</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00200005</resetValue>
          <resetMask>0xFFFF000F</resetMask>
          <fields>
            <field>
              <name>DSI_DATA_ENABLE</name>
              <description>DSI pixel data type enable:
Bit0: RGB565_CFG1
Bit1: RGB565_CFG2
Bit2: RGB565_CFG3
Bit3: RGB666_CFG1
Bit4: RGB666_CFG2
Bit5: RGB888
Bit6: RGB_10BIT
Bit7: RGB_12BIT, no support
Bit8: YUV422_12BIT, no support
Bit9: YUV422_10BIT, no support
Bit10: YUV422_8BIT, no support
Bit11:YUV420_8BIT,no support
others: Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI_DATA_TYPE</name>
              <description>DSI input pixel data type:
‘h0: RGB565_CFG1
‘h1: RGB565_CFG2
‘h2: RGB565_CFG3
‘h3: RGB666_CFG1
‘h4: RGB666_CFG2
‘h5: RGB888
‘h6: RGB_10BIT
‘h7: RGB_12BIT, no support
‘h8:YUV422_12BIT,no support
‘h9: YUV422_10BIT, no support
‘ha: YUV422_8BIT, no support
‘hb: YUV420_8BIT,no support
‘hc~’hf: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>common register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>LVB_DI1_CTL</name>
              <description>LVB DI1 optional general purpose control which is usually unused by display</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVB_DI0_CTL</name>
              <description>LVB DI0 optional general purpose control which is usually unused by display</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_WR_D0</name>
          <description>gpr write-read register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x07F7F3FF</resetMask>
          <fields>
            <field>
              <name>CSI1_CFG_AP_IF_CHECK_EN</name>
              <description>csi1 apb interface parity check enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI1_CFG_AP_IF_INT_EN</name>
              <description>csi1 apb interface error interrupt enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI1_CFG_APB_SLVERROR_EN</name>
              <description>csi1 apb interface error check enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI0_CFG_AP_IF_CHECK_EN</name>
              <description>csi0 apb interface parity check enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI0_CFG_AP_IF_INT_EN</name>
              <description>csi0 apb interface error interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI0_CFG_APB_SLVERROR_EN</name>
              <description>csi0 apb interface error check enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI1_DPIUPDATECFG</name>
              <description>dsi1 dpi update configure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI1_DPICOLORM</name>
              <description>dsi1 dpi cholor mode control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI1_DPISHUTDN</name>
              <description>dsi1 dpi shuntdown control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI0_DPIUPDATECFG</name>
              <description>dsi0 dpi update configure</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI0_DPICOLORM</name>
              <description>dsi0 dpi cholor mode control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI0_DPISHUTDN</name>
              <description>dsi0 dpi shuntdown control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI1_SOFT_RESET_N</name>
              <description>csi controller 1 reset, active low</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI0_SOFT_RESET_N</name>
              <description>csi controller 0 reset, active low</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI1_SOFT_RESET_N</name>
              <description>dsi controller 1 reset, active low</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI0_SOFT_RESET_N</name>
              <description>dsi controller 0 reset, active low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_WR_D1</name>
          <description>gpr write-read register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>JPEG_CTRL</name>
              <description>bit0: select cam0;
bit1: select cam1;
bit2: select jpeg;
bit3: select pdma</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_P1_CTRL</name>
              <description>bit0: select cam0;
bit1: select cam1;
bit2: select jpeg;
bit3: select pdma</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMA_P0_CTRL</name>
              <description>bit0: select cam0;
bit1: select cam1;
bit2: select jpeg;
bit3: select pdma</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDC1_P1_CTRL</name>
              <description>bit0: select cam0;
bit1: select cam1;
bit2: select jpeg;
bit3: select pdma</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDC1_P0_CTRL</name>
              <description>bit0: select cam0;
bit1: select cam1;
bit2: select jpeg;
bit3: select pdma</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDC0_P1_CTRL</name>
              <description>bit0: select cam0;
bit1: select cam1;
bit2: select jpeg;
bit3: select pdma</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDC0_P0_CTRL</name>
              <description>bit0: select cam0;
bit1: select cam1;
bit2: select jpeg;
bit3: select pdma</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_WR_D2</name>
          <description>gpr write-read register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x20003800</resetValue>
          <resetMask>0x3EFF7FFF</resetMask>
          <fields>
            <field>
              <name>TX_PHY0_PORT_PLL_RDY_SEL</name>
              <description>tx phy0 port_pll_rdy_sel</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_RATE_LVDS</name>
              <description>tx phy0 rate_lvds</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_PHY_MODE</name>
              <description>tx phy0 phy_mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_REFCLK_DIV</name>
              <description>tx phy0 refclk_div</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_IDDQ_EN</name>
              <description>tx phy0 iddq_en</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_RESET_N</name>
              <description>tx phy0 reset, active low</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_SHUTDOWNZ</name>
              <description>tx phy0 shutdownz, active low</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_BYPS_CKDET</name>
              <description>tx phy0 byps_ckdet</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_PLL_DIV</name>
              <description>tx phy0 pll_div</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_WR_D3</name>
          <description>gpr write-read register 3</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_PHY0_PLL_CTRL</name>
              <description>tx phy0 pll_ctrl</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
