RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
        <register>
          <name>GPR_WR_D4</name>
          <description>gpr write-read register 4</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000900</resetValue>
          <resetMask>0xFFFFFDFF</resetMask>
          <fields>
            <field>
              <name>TX_PHY0_TXCK_BIST_EN</name>
              <description>tx phy0 txck_bist_en</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX3_BIST_EN</name>
              <description>tx phy0 tx3_bist_en</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX2_BIST_EN</name>
              <description>tx phy0 tx2_bist_en</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX1_BIST_EN</name>
              <description>tx phy0 tx1_bist_en</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX0_BIST_EN</name>
              <description>tx phy0 tx0_bist_en</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TXCK_LPBK_EN</name>
              <description>tx_phy0 txck_lpbk_en</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX3_LPBK_EN</name>
              <description>tx_phy0 tx3_lpbk_en</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX2_LPBK_EN</name>
              <description>tx_phy0 tx2_lpbk_en</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX1_LPBK_EN</name>
              <description>tx_phy0 tx1_lpbk_en</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX0_LPBK_EN</name>
              <description>tx_phy0 tx0_lpbk_en</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TXCK_PAT_SEL</name>
              <description>tx phy0 txck_pat_sel</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX3_PAT_SEL</name>
              <description>tx phy0 tx3_pat_sel</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX2_PAT_SEL</name>
              <description>tx phy0 tx2_pat_sel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX1_PAT_SEL</name>
              <description>tx phy0 tx1_pat_sel</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_TX0_PAT_SEL</name>
              <description>tx phy0 tx0_pat_sel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_DSI0_PRBS_DISABLE</name>
              <description>tx phy0 dsi0_prbs_disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_DSI0_PRBS_START</name>
              <description>tx phy0 dsi0_prbs_start</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY0_CKPHY_CTL</name>
              <description>tx phy0 ckphy_ctl</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_WR_D5</name>
          <description>gpr write-read register 5</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x20003800</resetValue>
          <resetMask>0x3EFF7FFF</resetMask>
          <fields>
            <field>
              <name>TX_PHY1_PORT_PLL_RDY_SEL</name>
              <description>tx phy1 port_pll_rdy_sel</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_RATE_LVDS</name>
              <description>tx phy1 rate_lvds</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_PHY_MODE</name>
              <description>tx phy1 phy_mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_REFCLK_DIV</name>
              <description>tx phy1 refclk_div</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_IDDQ_EN</name>
              <description>tx phy1 iddq_en</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_RESET_N</name>
              <description>tx phy1 reset, active low</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_SHUTDOWNZ</name>
              <description>tx phy1 shutdownz, active low</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_BYPS_CKDET</name>
              <description>tx phy1 byps_ckdet</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_PLL_DIV</name>
              <description>tx phy1 pll_div</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_WR_D6</name>
          <description>gpr write-read register 6</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_PHY1_PLL_CTRL</name>
              <description>tx phy1 pll_ctrl</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_WR_D7</name>
          <description>gpr write-read register 7</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x00000900</resetValue>
          <resetMask>0xFFFFFDFF</resetMask>
          <fields>
            <field>
              <name>TX_PHY1_TXCK_BIST_EN</name>
              <description>tx phy1 txck_bist_en</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX3_BIST_EN</name>
              <description>tx phy1 tx3_bist_en</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX2_BIST_EN</name>
              <description>tx phy1 tx2_bist_en</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX1_BIST_EN</name>
              <description>tx phy1 tx1_bist_en</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX0_BIST_EN</name>
              <description>tx phy1 tx0_bist_en</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TXCK_LPBK_EN</name>
              <description>tx_phy1 txck_lpbk_en</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX3_LPBK_EN</name>
              <description>tx_phy1 tx3_lpbk_en</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX2_LPBK_EN</name>
              <description>tx_phy1 tx2_lpbk_en</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX1_LPBK_EN</name>
              <description>tx_phy1 tx1_lpbk_en</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX0_LPBK_EN</name>
              <description>tx_phy1 tx0_lpbk_en</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TXCK_PAT_SEL</name>
              <description>tx phy1 txck_pat_sel</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX3_PAT_SEL</name>
              <description>tx phy1 tx3_pat_sel</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX2_PAT_SEL</name>
              <description>tx phy1 tx2_pat_sel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX1_PAT_SEL</name>
              <description>tx phy1 tx1_pat_sel</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_TX0_PAT_SEL</name>
              <description>tx phy1 tx0_pat_sel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_DSI0_PRBS_DISABLE</name>
              <description>tx phy1 dsi0_prbs_disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_DSI0_PRBS_START</name>
              <description>tx phy1 dsi0_prbs_start</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PHY1_CKPHY_CTL</name>
              <description>tx phy1 ckphy_ctl</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_WR_D8</name>
          <description>gpr write-read register 8</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF7C0003</resetMask>
          <fields>
            <field>
              <name>RX_PHY0_BRUN_IN_MODE</name>
              <description>rx phy0 burn_in_mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY0_BURN_IN_EN_PAD</name>
              <description>rx phy0 burn_in_en_pad</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY0_LPBK_MODE</name>
              <description>rx phy0 lpbk_mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY0_BIST_FREQ_TRIM</name>
              <description>rx phy0 bist_freq_trim</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY0_RX0_BIST_EN</name>
              <description>rx phy0 rx0_bist_en rx1_bist_en</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY0_BIST_MODE</name>
              <description>rx phy0 bist_mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY0_BIST_EN_PAD</name>
              <description>rx phy0 bist_en_pad</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY0_BIST_EN</name>
              <description>rx phy0 bist_en</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY0_BIST_CKIN_SEL</name>
              <description>rx phy0 bist_ckin_sel</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY0_PHY_MODE</name>
              <description>rx phy0 phy_mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_WR_D9</name>
          <description>gpr write-read register 9</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF7C0003</resetMask>
          <fields>
            <field>
              <name>RX_PHY1_BRUN_IN_MODE</name>
              <description>rx phy1 burn_in_mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY1_BURN_IN_EN_PAD</name>
              <description>rx phy1 burn_in_en_pad</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY1_LPBK_MODE</name>
              <description>rx phy1 lpbk_mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY1_BIST_FREQ_TRIM</name>
              <description>rx phy1 bist_freq_trim</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY1_RX0_BIST_EN</name>
              <description>rx phy1 rx0_bist_en rx1_bist_en</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY1_BIST_MODE</name>
              <description>rx phy1 bist_mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY1_BIST_EN_PAD</name>
              <description>rx phy1 bist_en_pad</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY1_BIST_EN</name>
              <description>rx phy1 bist_en</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY1_BIST_CKIN_SEL</name>
              <description>rx phy1 bist_ckin_sel</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY1_PHY_MODE</name>
              <description>rx phy1 phy_mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_RO_D0</name>
          <description>gpr read-only register 0</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>TX_PHY1_CTL_O</name>
              <description>{2'b0,
tx_phy1_tx3_ctl_o,tx_phy1_tx2_ctl_o,
tx_phy1_tx1_ctl_o,tx_phy1_tx0_ctl_o,
tx_phy1_txck_ctl_o,tx_phy1_pll_dtest_o}</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_CTL_O</name>
              <description>{2'b0,
tx_phy0_tx3_ctl_o,tx_phy0_tx2_ctl_o,
tx_phy0_tx1_ctl_o,tx_phy0_tx0_ctl_o,
tx_phy0_txck_ctl_o,tx_phy0_pll_dtest_o}</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_RO_D1</name>
          <description>gpr read-only register 1</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_CSI0_AP</name>
              <description>interrupt of csi0 ap</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI0_CFG_CSI_AP_DIAG_FAULTS</name>
              <description>csi0 ap diag faults</description>
              <bitOffset>5</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI0_STA_AP_IF_INT_STA</name>
              <description>csi0 apb parity check interrupt satus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_RO_D2</name>
          <description>gpr read-only register 2</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_CSI1_AP</name>
              <description>interrupt of csi1 ap</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI1_CFG_CSI_AP_DIAG_FAULTS</name>
              <description>csi1 ap diag faults</description>
              <bitOffset>5</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI1_STA_AP_IF_INT_STA</name>
              <description>csi1 apb parity check interrupt satus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
