RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
        <register>
          <name>GPR_RO_D3</name>
          <description>gpr read-only register 3</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>RX_PHY0_RXCK_CTLO</name>
              <description>rx phy0 rxck_ctlo</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY0_RX1_CTLO</name>
              <description>rx phy0 rx1_ctlo</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY0_RX0_CTLO</name>
              <description>rx phy0 rx0_ctlo</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_RO_D4</name>
          <description>gpr read-only register 4</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>RX_PHY1_RXCK_CTLO</name>
              <description>rx phy1 rxck_ctlo</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY1_RX1_CTLO</name>
              <description>rx phy1 rx1_ctlo</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY1_RX0_CTLO</name>
              <description>rx phy1 rx0_ctlo</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_RO_D5</name>
          <description>gpr read-only register 5</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DSI0_PRBS_STATE</name>
              <description>dsi0_prbs_state for debug only</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TXCK_BIST_DONE_PAD</name>
              <description>tx phy0 txck_done_pad</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TXCK_BIST_OK_PAD</name>
              <description>tx phy0 txck_ok_pad</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TXCK_BIST_DONE</name>
              <description>tx phy0 txck_bist_done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TX3_BIST_DONE</name>
              <description>tx phy0 tx3_bist_done</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TX2_BIST_DONE</name>
              <description>tx phy0 tx2_bist_done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TX1_BIST_DONE</name>
              <description>tx phy0 tx1_bist_done</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TX0_BIST_DONE</name>
              <description>tx phy0 tx0_bist_done</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TXCK_BIST_OUT</name>
              <description>tx phy0 txck_bist_out</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TX3_BIST_OUT</name>
              <description>tx phy0 tx3_bist_out</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TX2_BIST_OUT</name>
              <description>tx phy0 tx2_bist_out</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TX1_BIST_OUT</name>
              <description>tx phy0 tx1_bist_out</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY0_TX0_BIST_OUT</name>
              <description>tx phy0 tx0_bist_out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_RO_D6</name>
          <description>gpr read-only register 6</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DSI1_PRBS_STATE</name>
              <description>dsi1_prbs_state for debug only</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TXCK_BIST_DONE_PAD</name>
              <description>tx phy1 txck_done_pad</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TXCK_BIST_OK_PAD</name>
              <description>tx phy1 txck_ok_pad</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TXCK_BIST_DONE</name>
              <description>tx phy1 txck_bist_done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TX3_BIST_DONE</name>
              <description>tx phy1 tx3_bist_done</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TX2_BIST_DONE</name>
              <description>tx phy1 tx2_bist_done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TX1_BIST_DONE</name>
              <description>tx phy1 tx1_bist_done</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TX0_BIST_DONE</name>
              <description>tx phy1 tx0_bist_done</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TXCK_BIST_OUT</name>
              <description>tx phy1 txck_bist_out</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TX3_BIST_OUT</name>
              <description>tx phy1 tx3_bist_out</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TX2_BIST_OUT</name>
              <description>tx phy1 tx2_bist_out</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TX1_BIST_OUT</name>
              <description>tx phy1 tx1_bist_out</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_PHY1_TX0_BIST_OUT</name>
              <description>tx phy1 tx0_bist_out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_RO_D7</name>
          <description>gpr read-only register 7</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <field>
              <name>RX_PHY0_BURN_IN_OK_PAD</name>
              <description>rx_phy0_burn_in_ok_pad</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY0_RX1_BIST_DONE</name>
              <description>rx phy0 rx1_bist_done</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY0_RX0_BIST_DONE</name>
              <description>rx phy0 rx0_bist_done</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY0_RX1_BIST_OUT</name>
              <description>rx phy0 rx1_bist_out</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY0_RX0_BIST_OUT</name>
              <description>rx phy0 rx0_bist_out</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY0_BIST_OK_PAD</name>
              <description>rx phy0 bist_ok_pad</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY0_BIST_DONE_PAD</name>
              <description>rx phy0 bist_done_pad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_RO_D8</name>
          <description>gpr read-only register 8</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <field>
              <name>RX_PHY1_BURN_IN_OK_PAD</name>
              <description>rx_phy1_burn_in_ok_pad</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY1_RX1_BIST_DONE</name>
              <description>rx phy1 rx1_bist_done</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY1_RX0_BIST_DONE</name>
              <description>rx phy1 rx0_bist_done</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY1_RX1_BIST_OUT</name>
              <description>rx phy1 rx1_bist_out</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY1_RX0_BIST_OUT</name>
              <description>rx phy1 rx0_bist_out</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY1_BIST_OK_PAD</name>
              <description>rx phy1 bist_ok_pad</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_PHY1_BIST_DONE_PAD</name>
              <description>rx phy1 bist_done_pad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_RO_D9</name>
          <description>gpr read-only register 9</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
        </register>
        <register>
          <name>GPR_WR1_CLR_D0</name>
          <description>gpr write1 set/no-write clr register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPR_WR1_CLR_DATA</name>
              <description>gpr register, write 1 /no-write  set/clr matching bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
