RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>LCB</name>
      <description>LCB</description>
      <groupName>LCB</groupName>
      <baseAddress>0xf1038000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x98</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x000001F3</resetMask>
          <fields>
            <field>
              <name>LVDS_RXCK_SEL</name>
              <description>just for LVDS Display mode and CAM LINK mode,  clock selection:
1: LVDS1 RXCK
0: LVDS0 RXCK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_LINK_WIDTH</name>
              <description>just for CAM LINK mode,  data width:
00: 24bit
01: 30bit
10: 36bit
11: reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT_MAPPING</name>
              <description>just for LVDS Display mode,  data protocol:
1: JEIDA standard
0: SPWG standard</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_WIDTH</name>
              <description>just for LVDS Display mode,  data width:
1: 24bit
0: 18bit(3line)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>mode selection：
00: lvds display(4 line), two LVDS RX PHY must be LVDS display mode
01: cam link(4 line), two LVDS RX PHY must be LVDS display mode
10: sync code(2 line), LVDS RX PHY must be LVDS cameral mode
11: sync code(1line), LVDS RX PHY must be LVDS cameral mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_STAT</name>
          <description>LVDS RX PHY Status register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>LVDS1_RX_PHY_DLL_LOCK</name>
              <description>LVDS1 RX PHY DLL Lock indication Signal, 1 means dll already locked</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVDS0_RX_PHY_DLL_LOCK</name>
              <description>LVDS0 RX PHY DLL Lock indication Signal, 1 means dll already locked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>lvds0,lvds1</dimIndex>
          <name>PHY_POW_CTRL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>IDDQ_EN</name>
              <description>Power down control signal of channel rxck/rx1/rx0
0: Normal operation
1: Power down channel</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCK_PD</name>
              <description>Power down control signal of channel rxck
0: Normal operation
1: Power down channel</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX1_PD</name>
              <description>Power down control signal of channel rx1
0: Normal operation
1: Power down channel</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX0_PD</name>
              <description>Power down control signal of channel rx0
0: Normal operation
1: Power down channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>lvds0_rx0,lvds0_rx1,lvds1_rx0,lvds1_rx1</dimIndex>
          <name>PHY_D_CTRL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x00080E29</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>RX_VCOM</name>
              <description>bit 1: Receiver hysteresis enable signal. 0: enable; 1: disable
bit 0: Terminal impedance common mode selection control signal. 0: floating; 1: Ground</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_RTERM</name>
              <description>Terminal impedance regulation control signal
0000: hi-z;
0001: 150ohm;
1000:100ohm;
1111:75ohm</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CTL</name>
              <description>bit 0 :  Lane N Data MSB first enable signal. 0: LSB ; 1: MSB
bit 1 :  Lane N Data Polarity signal. 0: Not inverting; 1: Inverting
bit [4:2] : Phase difference between the output first bit data (rxN[6:0]) and the input clock (RCKP/N) in LVDS Display Mode.
bit 5 : Reserved
bit 6 : Output data sampling clock control signal
0: Sampling using the rising edge of the clock pck.
1: Sampling using the falling edge of the clock pck.
bit 7 : Reserved
bit 8 : Data Lane N Skew adjust enable in LVDS Camera Mode.
bit [12:9] : Data Lane N Skew adjust; 0000: min; 0111: default; 1111: max.
bit [15:13] : Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>lvds0_rxck,lvds1_rxck</dimIndex>
          <name>PHY_CK_CTRL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x00080435</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>RX_VCOM</name>
              <description>bit 1: Receiver hysteresis enable signal. 0: enable; 1: disable
bit 0: Terminal impedance common mode selection control signal. 0: floating; 1: Ground</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_RTERM</name>
              <description>Terminal impedance regulation control signal
0000: hi-z;
0001: 150ohm;
1000:100ohm;
1111:75ohm</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CTL</name>
              <description>bit 0 : DLL loop delay adjustment minimum control signal
0: used for RCKP/RCKN’s frequency is 40Mhz~70Mhz
1:used for RCKP/RCKN’s frequency is 70Mhz~110Mhz
bit [2:1] : DLL loop delay adjustment current regulation control signal. 00: min; 11: max
bit 3 : Reserved
bit 4 : Clock Lane Skew adjust enable in LVDS Camera Mode.
bit [7:5] : Bus width selection in LVDS Camera Mode
000: 4bit; 001:6bit; 010:7bit; 011:8bit; 100:9bit; 101:10bit; 110:11bit; 111:12bit.
bit [10:8] : DDR Clock duty cycle adjust in LVDS Camera Mode.
bit [15:11] : Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>lvds0,lvds1</dimIndex>
          <name>PHY_ADJ_CTRL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x414101FF</resetValue>
          <resetMask>0xFFFF01FF</resetMask>
          <fields>
            <field>
              <name>LVDS_RX0_DLINE_ADJ</name>
              <description>LVDS RX PHY RX0 line:
bit [7:0] : Lane N skew adjustment control signal between data and clock
0000000: max; 1111111: min
bit 8 : Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS_RX1_DLINE_ADJ</name>
              <description>LVDS RX PHY RX1 line:
bit [7:0] : Lane N skew adjustment control signal between data and clock
0000000: max; 1111111: min
bit 8 : Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS_DLL_TUNING_INT</name>
              <description>LVDS RX PHY RXCK line:
DLL loop delay coarse adjustment initial signal
00000000: min ; 11111111: max</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>lvds0,lvds1</dimIndex>
          <name>PHY_SU_CTRL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>SU_CTRL</name>
              <description>bit [2:0] : Reference voltage/current adjustment control signal. 000: min; 111: max
bit [3] : Internal bias circuit selection signal. 0: from Bandgap Mode; 1: from self-bias mode
bit [7:4] : Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
