RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
        <register>
          <name>RFSHCTL1</name>
          <description>Description: Refresh Control Register 1</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>
          <fields>
            <field>
              <name>REFRESH_TIMER1_START_VALUE_X32</name>
              <description>Description: Refresh timer start for rank 1 (only present in multi-rank configurations). This is useful in staggering the refreshes to multiple ranks to help traffic to proceed. This is explained in Refresh Controls section of architecture chapter.
Unit: Multiples of 32 clocks. FOR PERFORMANCE ONLY.
Value After Reset: 0x0
Exists: MEMC_NUM_RANKS&gt;1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFRESH_TIMER0_START_VALUE_X32</name>
              <description>Description: Refresh timer start for rank 0 (only present in multi-rank configurations). This is useful in staggering the refreshes to multiple ranks to help traffic to proceed. This is explained in Refresh Controls section of architecture chapter.
Unit: Multiples of 32 clocks. FOR PERFORMANCE ONLY.
Value After Reset: 0x0
Exists: MEMC_NUM_RANKS&gt;1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFSHCTL3</name>
          <description>Description: Refresh Control Register 0</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>REFRESH_UPDATE_LEVEL</name>
              <description>Description: Toggle this signal (either from 0 to 1 or from 1 to 0) to indicate that the refresh register(s) have been updated.
The value is automatically updated when exiting soft reset, so it does not need to be toggled initially.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_AUTO_REFRESH</name>
              <description>Description: When '1', disable auto-refresh generated by the uMCTL2. When auto-refresh is disabled, the SoC core must generate refreshes using the registers reg_ddrc_rank0_refresh, reg_ddrc_rank1_refresh, reg_ddrc_rank2_refresh and reg_ddrc_rank3_refresh.
When dis_auto_refresh transitions from 0 to 1, any pending refreshes are immediately scheduled by the uMCTL2.
If DDR4 CRC/parity retry is enabled (CRCPARCTL1.crc_parity_retry_enable = 1), disable auto- refresh is not supported, and this bit must be set to '0'.
This register field is changeable on the fly.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFSHTMG</name>
          <description>Description: Refresh Timing Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x0062008C</resetValue>
          <resetMask>0x0FFF01FF</resetMask>
          <fields>
            <field>
              <name>T_RFC_NOM_X32</name>
              <description>Description: tREFI: Average time interval between refreshes per rank (specification: 7.8us for DDR2, DDR3 and DDR4. See JEDEC specification for mDDR, LPDDR2 and LPDDR3).
For LPDDR2/LPDDR3:
if using all-bank refreshes (RFSHCTL0.per_bank_refresh
= 0), this register should be set to tREFIab
if using per-bank refreshes (RFSHCTL0.per_bank_refresh = 1), this register should be set to tREFIpb
For configurations with MEMC_FREQ_RATIO=2, program this to (tREFI/2), no rounding up.
In DDR4 mode, tREFI value is different depending on the refresh mode. The user should program the appropriate value from the spec based on the value programmed in the refresh mode register.
Note that RFSHTMG.t_rfc_nom_x32 * 32 must be greater than RFSHTMG.t_rfc_min. Unit: Multiples of 32 clocks.
Value After Reset: 0x62
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_RFC_MIN</name>
              <description>Description: tRFC (min): Minimum time from refresh to refresh or activate.
For LPDDR2/LPDDR3:
if using all-bank refreshes (RFSHCTL0.per_bank_refresh
= 0), this register should be set to tRFCab
if using per-bank refreshes (RFSHCTL0.per_bank_refresh = 1), this register should be set to tRFCpb
For configurations with MEMC_FREQ_RATIO=2, program this to tRFC(min)/2 and round up to next integer value.
In DDR4 mode, tRFC(min) value is different depending on the refresh mode (fixed 1X,2X,4X) and the device density. The user should program the appropriate value from the spec based on the 'refresh_mode' and the device density that is used.
Unit: Clocks.
Value After Reset: 0x8c
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCUADDR0</name>
          <description>Description: ECC Uncorrected Error Address Register 0</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0303FFFF</resetMask>
          <fields>
            <field>
              <name>ECC_UNCORR_RANK</name>
              <description>Description: Rank number of a read resulting in an uncorrected ECC error
Value After Reset: 0x0
Exists: MEMC_NUM_RANKS&gt;1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECC_UNCORR_ROW</name>
              <description>Description: Page/row number of a read resulting in an uncorrected ECC error. This is 18-bits wide in configurations with DDR4 support and 16-bits in all other configurations.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPARCTL0</name>
          <description>Description: CRC Parity Control Register0</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>DFI_ALERT_ERR_CNT_CLR</name>
              <description>Description: DFI alert error count clear. Clear bit for DFI alert error counter. Asserting this bit will clear the DFI alert error counter, CRCPARSTAT.dfi_alert_err_cnt. When the clear operation is complete, the uMCTL2 automatically clears this bit.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_ALERT_ERR_INT_CLR</name>
              <description>Description: Interrupt clear bit for DFI alert error. If this bit is set, the alert error interrupt on CRCPARSTAT.dfi_alert_err_int will be cleared. When the clear operation is complete, the uMCTL2 automatically clears this bit.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_ALERT_ERR_INT_EN</name>
              <description>Description: Interrupt enable bit for DFI alert error. If this bit is set, any parity/CRC error detected on the dfi_alert_n input will result in an interrupt being set on CRCPARSTAT.dfi_alert_err_int.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPARSTAT</name>
          <description>Description: CRC Parity Status Register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>DFI_ALERT_ERR_INT</name>
              <description>Description: DFI alert error interrupt.
If a parity/CRC error is detected on dfi_alert_n, and the interrupt is enabled by CRCPARCTL0.dfi_alert_err_int_en, this interrupt bit will be set. It will remain set until cleared by CRCPARCTL0.dfi_alert_err_int_clr
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFI_ALERT_ERR_CNT</name>
              <description>Description: DFI alert error count.
If a parity/CRC error is detected on dfi_alert_n, this counter be incremented. This is independent of the setting of CRCPARCTL0.dfi_alert_err_int_en. It will saturate at 0xFFFF, and can be cleared by asserting CRCPARCTL0.dfi_alert_err_cnt_clr.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT0</name>
          <description>Description: SDRAM Initialization Register 0</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x0002004E</resetValue>
          <resetMask>0xC3FF03FF</resetMask>
          <fields>
            <field>
              <name>SKIP_DRAM_INIT</name>
              <description>Description: If lower bit is enabled the SDRAM initialization routine is skipped. The upper bit decides what state the controller starts up in when reset is removed
00 - SDRAM Initialization routine is run after power-up
01 - SDRAM Initialization routine is skipped after power- up. Controller starts up in Normal Mode
11 - SDRAM Initialization routine is skipped after power- up. Controller starts up in Self-refresh Mode
10 - SDRAM Initialization routine is run after power-up.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POST_CKE_X1024</name>
              <description>Description: Cycles to wait after driving CKE high to start the SDRAM initialization sequence.
Unit: 1024 clocks.
DDR2 typically requires a 400 ns delay, requiring this value to be programmed to 2 at all clock speeds.
LPDDR2/LPDDR3 typically requires this to be programmed for a delay of 200 us.
For configurations with MEMC_FREQ_RATIO=2, program this to JEDEC spec value divided by 2, and round it up to next integer value.
Value After Reset: 0x2
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_CKE_X1024</name>
              <description>Description: Cycles to wait after reset before driving CKE high to start the SDRAM initialization sequence.
Unit: 1024 clock cycles.
DDR2 specifications typically require this to be programmed for a delay of &gt;= 200 us.
LPDDR2/LPDDR3: tINIT1 of 100 ns (min)
For configurations with MEMC_FREQ_RATIO=2, program this to JEDEC spec value divided by 2, and round it up to next integer value.
Value After Reset: 0x4e
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT1</name>
          <description>Description: SDRAM Initialization Register 1</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF7F0F</resetMask>
          <fields>
            <field>
              <name>DRAM_RSTN_X1024</name>
              <description>Description: Number of cycles to assert SDRAM reset signal during init sequence.
This is only present for designs supporting DDR3/DDR4 devices. For use with a Synopsys DDR PHY, this should be set to a minimum of 1
Value After Reset: 0x0
Exists: MEMC_DDR3==1 || MEMC_DDR4==1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FINAL_WAIT_X32</name>
              <description>Description: Cycles to wait after completing the SDRAM initialization sequence before starting the dynamic scheduler.
Unit: Counts of a global timer that pulses every 32 clock cycles.
There is no known specific requirement for this; it may be set to zero.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_OCD_X32</name>
              <description>Description: Wait period before driving the OCD complete command to SDRAM.
Unit: Counts of a global timer that pulses every 32 clock cycles.
There is no known specific requirement for this; it may be set to zero.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT3</name>
          <description>Description: SDRAM Initialization Register 3</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0x00000510</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MR</name>
              <description>Description: DDR2: Value to write to MR register. Bit 8 is for DLL and the setting here is ignored. The uMCTL2 sets this bit appropriately.
DDR3/DDR4: Value loaded into MR0 register. mDDR: Value to write to MR register.
LPDDR2/LPDDR3 - Value to write to MR1 register
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMR</name>
              <description>Description: DDR2: Value to write to EMR register. Bits 9:7 are for OCD and the setting in this register is ignored. The uMCTL2 sets those bits appropriately.
DDR3/DDR4: Value to write to MR1 register Set bit 7 to 0. If PHY-evaluation mode training is enabled, this bit is set appropriately by the uMCTL2 during write leveling.
mDDR: Value to write to EMR register. LPDDR2/LPDDR3 - Value to write to MR2 register Value After Reset: 0x510
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT4</name>
          <description>Description: SDRAM Initialization Register 4</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EMR2</name>
              <description>Description: DDR2: Value to write to EMR2 register. DDR3/DDR4: Value to write to MR2 register LPDDR2/LPDDR3: Value to write to MR3 register mDDR: Unused
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMR3</name>
              <description>Description: DDR2: Value to write to EMR3 register. DDR3/DDR4: Value to write to MR3 register mDDR/LPDDR2/LPDDR3: Unused
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT5</name>
          <description>Description: SDRAM Initialization Register 5</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0x00100000</resetValue>
          <resetMask>0x00FF0000</resetMask>
          <fields>
            <field>
              <name>DEV_ZQINIT_X32</name>
              <description>Description: ZQ initial calibration, tZQINIT. Present only in designs configured to support DDR3 or DDR4 or LPDDR2/LPDDR3.
Unit: 32 clock cycles.
DDR3 typically requires 512 clocks. DDR4 requires 1024 clocks.
LPDDR2/LPDDR3 requires 1 us.
Value After Reset: 0x10
Exists: MEMC_DDR3==1 || MEMC_DDR4 == 1 || MEMC_LPDDR2==1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIMMCTL</name>
          <description>Description: DIMM Control Register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>DIMM_ADDR_MIRR_EN</name>
              <description>Description: Address Mirroring Enable (for multi-rank UDIMM implementations and multi-rank DDR4 RDIMM implementations).
Some UDIMMs and DDR4 RDIMMs implement address mirroring for odd ranks, which means that the following address, bank address and bank group bits are swapped: (A3, A4), (A5, A6), (A7, A8), (BA0, BA1) and also (A11, A13),
(BG0, BG1) for the DDR4. Setting this bit ensures that, for mode register accesses during the automatic initialization routine, these bits are swapped within the uMCTL2 to compensate for this UDIMM/RDIMM swapping. In addition to the automatic initialization routine, in case of DDR4 UDIMM/RDIMM, they are swapped during the automatic MRS access to enable/disable of a particular DDR4 feature.
Note: This has no effect on the address of any other memory accesses, or of software-driven mode register accesses.
This is not supported for mDDR, LPDDR2 or LPDDR3 SDRAMs.
Note: In case of x16 DDR4 DIMMs, BG1 output of MRS for the odd ranks is same as BG0 because BG1 is invalid, hence dimm_dis_bg_mirroring register must be set to 1.
1 - For odd ranks, implement address mirroring for MRS commands to during initialization and for any automatic DDR4 MRS commands (to be used if UDIMM/RDIMM implements address mirroring)
0 - Do not implement address mirroring
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIMM_STAGGER_CS_EN</name>
              <description>Description: Staggering enable for multi-rank accesses (for multi-rank UDIMM and RDIMM implementations only). This is not supported for DDR4, mDDR, LPDDR2 or LPDDR3 SDRAMs.
1 - Stagger accesses to even and odd ranks
0 - Do not stagger accesses
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
