RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
        <register>
          <name>ZQCTL0</name>
          <description>Description: ZQ Control Register 0</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0x02000040</resetValue>
          <resetMask>0xE3FF03FF</resetMask>
          <fields>
            <field>
              <name>DIS_AUTO_ZQ</name>
              <description>Description:
1 - Disable uMCTL2 generation of ZQCS command. Register reg_ddrc_zq_calib_short can be used instead to control ZQ calibration commands.
0 - Internally generate ZQCS commands based on ZQCTL1.t_zq_short_interval_x1024.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3 devices.
Value After Reset: 0x0
Exists: MEMC_DDR3==1 || MEMC_DDR4==1 || MEMC_LPDDR2==1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_SRX_ZQCL</name>
              <description>Description:
1 - Disable issuing of ZQCL command at Self-Refresh exit. Only applicable when run in DDR3 or DDR4 or LPDDR2 or LPDDR3 mode.
0 - Enable issuing of ZQCL command at Self-Refresh exit. Only applicable when run in DDR3 or DDR4 or LPDDR2 or LPDDR3 mode.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3 devices.
Value After Reset: 0x0
Exists: MEMC_DDR3==1 || MEMC_DDR4==1 || MEMC_LPDDR2==1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZQ_RESISTOR_SHARED</name>
              <description>Description:
1 - Denotes that ZQ resistor is shared between ranks. Means ZQinit/ZQCL/ZQCS commands are sent to one rank at a time with tZQinit/tZQCL/tZQCS timing met between commands so that commands to different ranks do not overlap.
0 - ZQ resistor is not shared.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3 devices.
Value After Reset: 0x0
Exists: MEMC_DDR3==1 || MEMC_DDR4==1 || MEMC_LPDDR2==1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_ZQ_LONG_NOP</name>
              <description>Description: tZQoper for DDR3/DDR4, tZQCL for LPDDR2/LPDDR3: Number of cycles of NOP required after a ZQCL (ZQ calibration long) command is issued to SDRAM.
For configurations with MEMC_FREQ_RATIO=2: DDR3/DDR4: program this to tZQoper/2 and round it up to the next integer value.
LPDDR2/LPDDR3: program this to tZQCL/2 and round it up to the next integer value.
Unit: Clock cycles.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3 devices.
Value After Reset: 0x200
Exists: MEMC_DDR3==1 || MEMC_DDR4==1 || MEMC_LPDDR2==1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_ZQ_SHORT_NOP</name>
              <description>Description: tZQCS: Number of cycles of NOP required after a ZQCS (ZQ calibration short) command is issued to SDRAM.
For configurations with MEMC_FREQ_RATIO=2, program this to tZQCS/2 and round it up to the next integer value. Unit: Clock cycles.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3 devices.
Value After Reset: 0x40
Exists: MEMC_DDR3==1 || MEMC_DDR4==1 || MEMC_LPDDR2==1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZQCTL1</name>
          <description>Description: ZQ Control Register 1</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>T_ZQ_SHORT_INTERVAL_X1024</name>
              <description>Description: Average interval to wait between automatically issuing ZQCS (ZQ calibration short) commands to DDR3/DDR4/LPDDR2/LPDDR3 devices.
Meaningless, if ZQCTL0.dis_auto_zq=1. Unit: 1024 clock cycles.
This is only present for designs supporting DDR3/DDR4 or LPDDR2/LPDDR3 devices.
Value After Reset: 0x100
Exists: MEMC_DDR3==1 || MEMC_DDR4==1 || MEMC_LPDDR2==1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZQSTAT</name>
          <description>Description: ZQ Status Register</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>ZQ_RESET_BUSY</name>
              <description>Description: SoC core may initiate a ZQ Reset operation only if this signal is low. This signal goes high in the clock after the uMCTL2 accepts the ZQ Reset request. It goes low when the ZQ Reset command is issued to the SDRAM and the associated NOP period is over. It is recommended not to perform ZQ Reset commands when this signal is high.
0 - Indicates that the SoC core can initiate a ZQ Reset operation
1 - Indicates that ZQ Reset operation is in progress
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFITMG0</name>
          <description>Description: DFI Timing Register 0</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <resetValue>0x07020002</resetValue>
          <resetMask>0x1FBFBF3F</resetMask>
          <fields>
            <field>
              <name>DFI_T_CTRL_DELAY</name>
              <description>Description: Specifies the number of DFI clock cycles after an assertion or de-assertion of the DFI control signals that the control signals at the PHY-DRAM interface reflect the assertion or de-assertion. If the DFI clock and the memory clock are not phase-aligned, this timing parameter should be rounded up to the next integer value. Note that if using RDIMM, depending on the PHY, it may be necessary to increment this parameter by 1. This is to compensate for the extra cycle of latency through the RDIMM
Value After Reset: 0x7
Exists: Always</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_RDDATA_USE_SDR</name>
              <description>Description: Defines whether dfi_rddata_en/dfi_rddata/dfi_rddata_valid is generated using HDR or SDR values Selects whether value in DFITMG0.dfi_t_rddata_en is in terms of SDR or HDR clock cycles:
0 in terms of HDR clock cycles
1 in terms of SDR clock cycles
Refer to PHY specification for correct value.
Value After Reset: 0x0
Exists: MEMC_FREQ_RATIO==2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_T_RDDATA_EN</name>
              <description>Description: Time from the assertion of a read command on the DFI interface to the assertion of the dfi_rddata_en signal. Refer to PHY specification for correct value.
This corresponds to the DFI parameter trddata_en. Note that, depending on the PHY, if using RDIMM, it may be necessary to use the value (CL + 1) in the calculation of trddata_en. This is to compensate for the extra cycle of latency through the RDIMM.
Unit: Clocks
Value After Reset: 0x2
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_WRDATA_USE_SDR</name>
              <description>Description: Defines whether dfi_wrdata_en/dfi_wrdata/dfi_wrdata_mask is generated using HDR or SDR values Selects whether value in DFITMG0.dfi_tphy_wrlat is in terms of SDR or HDR clock cycles Selects whether value in DFITMG0.dfi_tphy_wrdata is in terms of SDR or HDR clock cycles
0 in terms of HDR clock cycles
1 in terms of SDR clock cycles
Refer to PHY specification for correct value.
Value After Reset: 0x0
Exists: MEMC_FREQ_RATIO==2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_TPHY_WRDATA</name>
              <description>Description: Specifies the number of clock cycles between when dfi_wrdata_en is asserted to when the associated write data is driven on the dfi_wrdata signal. This corresponds to the DFI timing parameter tphy_wrdata. Refer to PHY specification for correct value. Note, max supported value is 8.
Unit: Clocks
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_TPHY_WRLAT</name>
              <description>Description: Write latency
Number of clocks from the write command to write data enable (dfi_wrdata_en). This corresponds to the DFI timing parameter tphy_wrlat. The minimum supported value is as follows:
0 for configurations with MEMC_WL0 = 1
1 for configurations with MEMC_WL0 = 0
Refer to PHY specification for correct value.Note that, depending on the PHY, if using RDIMM, it may be necessary to use the value (CL + 1) in the calculation of tphy_wrlat. This is to compensate for the extra cycle of latency through the RDIMM.
Value After Reset: 0x2
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFITMG1</name>
          <description>Description: DFI Timing Register 1</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <resetValue>0x00000404</resetValue>
          <resetMask>0x001F0F0F</resetMask>
          <fields>
            <field>
              <name>DFI_T_WRDATA_DELAY</name>
              <description>Description: Specifies the number of DFI clocks between when the dfi_wrdata_en signal is asserted and when the corresponding write data transfer is completed on the DRAM bus. This corresponds to the DFI timing parameter twrdata_delay. Refer to PHY specification for correct value. For DFI 3.0 PHY, set to twrdata_delay, a new timing parameter introduced in DFI 3.0. For DFI 2.1 PHY, set to tphy_wrdata + (delay of DFI write data to the DRAM). Value to be programmed is in terms of DFI clocks, not PHY clocks. In FREQ_RATIO=2, divide PHY's value by 2 and round up to next integer. If using DFITMG0.dfi_wrdata_use_sdr=1, add 1 to the value.
Unit: Clocks
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_T_DRAM_CLK_DISABLE</name>
              <description>Description: Specifies the number of DFI clock cycles from the assertion of the dfi_dram_clk_disable signal on the DFI until the clock to the DRAM memory devices, at the PHY- DRAM boundary, maintains a low value. If the DFI clock and the memory clock are not phase aligned, this timing parameter should be rounded up to the next integer value.
Value After Reset: 0x4
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_T_DRAM_CLK_ENABLE</name>
              <description>Description: Specifies the number of DFI clock cycles from the de-assertion of the dfi_dram_clk_disable signal on the DFI until the first valid rising edge of the clock to the DRAM memory devices, at the PHY-DRAM boundary. If the DFI clock and the memory clock are not phase aligned, this timing parameter should be rounded up to the next integer value.
Value After Reset: 0x4
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFILPCFG0</name>
          <description>Description: DFI Low Power Configuration Register 0</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <resetValue>0x07000000</resetValue>
          <resetMask>0x0F00F1F1</resetMask>
          <fields>
            <field>
              <name>DFI_TLP_RESP</name>
              <description>Description: Setting for DFI's tlp_resp time.
Same value is used for both Power Down, Self Refresh, Deep Power Down and Maximum Power Saving modes. DFI 2.1 specification onwards, recommends using a fixed
value of 7 always.
Value After Reset: 0x7
Exists: Always</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_LP_WAKEUP_SR</name>
              <description>Description: Value to drive on dfi_lp_wakeup signal when Self Refresh mode is entered.
Determines the DFI's tlp_wakeup time:
0x0 - 16 cycles
0x1 - 32 cycles
0x2 - 64 cycles
0x3 - 128 cycles
0x4 - 256 cycles
0x5 - 512 cycles
0x6 - 1024 cycles
0x7 - 2048 cycles
0x8 - 4096 cycles
0x9 - 8192 cycles
0xA - 16384 cycles
0xB - 32768 cycles
0xC - 65536 cycles
0xD - 131072 cycles
0xE - 262144 cycles
0xF - Unlimited Value After Reset: 0x0 Exists: Always</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_LP_EN_SR</name>
              <description>Description: Enables DFI Low Power interface handshaking during Self Refresh Entry/Exit.
0 - Disabled
1 - Enabled
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_LP_WAKEUP_PD</name>
              <description>Description: Value to drive on dfi_lp_wakeup signal when Power Down mode is entered.
Determines the DFI's tlp_wakeup time:
0x0 - 16 cycles
0x1 - 32 cycles
0x2 - 64 cycles
0x3 - 128 cycles
0x4 - 256 cycles
0x5 - 512 cycles
0x6 - 1024 cycles
0x7 - 2048 cycles
0x8 - 4096 cycles
0x9 - 8192 cycles
0xA - 16384 cycles
0xB - 32768 cycles
0xC - 65536 cycles
0xD - 131072 cycles
0xE - 262144 cycles
0xF - Unlimited Value After Reset: 0x0 Exists: Always</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_LP_EN_PD</name>
              <description>Description: Enables DFI Low Power interface handshaking during Power Down Entry/Exit.
0 - Disabled
1 - Enabled
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIUPD0</name>
          <description>Description: DFI Update Register 0</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <resetValue>0x00400003</resetValue>
          <resetMask>0x83FF03FF</resetMask>
          <fields>
            <field>
              <name>DIS_AUTO_CTRLUPD</name>
              <description>Description: When '1', disable the automatic dfi_ctrlupd_req generation by the uMCTL2. The core must issue the dfi_ctrlupd_req signal using register reg_ddrc_ctrlupd. This register field is changeable on the fly.
When '0', uMCTL2 issues dfi_ctrlupd_req periodically.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_T_CTRLUP_MAX</name>
              <description>Description: Specifies the maximum number of clock cycles that the dfi_ctrlupd_req signal can assert. Lowest value to assign to this variable is 0x40.
Unit: Clocks
Value After Reset: 0x40
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_T_CTRLUP_MIN</name>
              <description>Description: Specifies the minimum number of clock cycles that the dfi_ctrlupd_req signal must be asserted. The uMCTL2 expects the PHY to respond within this time. If the PHY does not respond, the uMCTL2 will de-assert dfi_ctrlupd_req after dfi_t_ctrlup_min + 2 cycles. Lowest value to assign to this variable is 0x3.
Unit: Clocks
Value After Reset: 0x3
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIUPD1</name>
          <description>Description: DFI Update Register 1</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <fields>
            <field>
              <name>DFI_T_CTRLUPD_INTERVAL_MIN_X1024</name>
              <description>Description: This is the minimum amount of time between uMCTL2 initiated DFI update requests (which is executed whenever the uMCTL2 is idle). Set this number higher to reduce the frequency of update requests, which can have a small impact on the latency of the first read request when the uMCTL2 is idle.
Unit: 1024 clocks Value After Reset: 0x0
 Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_T_CTRLUPD_INTERVAL_MAX_X1024</name>
              <description>Description: This is the maximum amount of time between uMCTL2 initiated DFI update requests. This timer resets with each update request; when the timer expires dfi_ctrlupd_req is sent and traffic is blocked until the dfi_ctrlupd_ackx is received. PHY can use this idle time to recalibrate the delay lines to the DLLs. The DFI controller update is also used to reset PHY FIFO pointers in case of data capture errors.
Updates are required to maintain calibration over PVT, but frequent updates may impact performance.
Note: Value programmed for DFIUPD1.dfi_t_ctrlupd_interval_max_x1024 must be greater than DFIUPD1.dfi_t_ctrlupd_interval_min_x1024.
Unit: 1024 clocks Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIUPD2</name>
          <description>Description: DFI Update Register 2</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <resetValue>0x80100010</resetValue>
          <resetMask>0x8FFF0FFF</resetMask>
          <fields>
            <field>
              <name>DFI_PHYUPD_EN</name>
              <description>Description: Enables the support for acknowledging PHY- initiated updates:
0 - Disabled
1 - Enabled
Value After Reset: 0x1
Exists: Always</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_PHYUPD_TYPE1</name>
              <description>Description: Specifies the maximum number of DFI clock cycles that the dfi_phyupd_req signal may remain asserted after the assertion of the dfi_phyupd_ack signal for dfi_phyupd_type = 2'b01. The dfi_phyupd_req signal may de-assert at any cycle after the assertion of the dfi_phyupd_ack signal.
Value After Reset: 0x10
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_PHYUPD_TYPE0</name>
              <description>Description: Specifies the maximum number of DFI clock cycles that the dfi_phyupd_req signal may remain asserted after the assertion of the dfi_phyupd_ack signal for dfi_phyupd_type = 2'b00. The dfi_phyupd_req signal may de-assert at any cycle after the assertion of the dfi_phyupd_ack signal.
Value After Reset: 0x10
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIUPD3</name>
          <description>Description: DFI Update Register 3</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <resetValue>0x00100010</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>
          <fields>
            <field>
              <name>DFI_PHYUPD_TYPE3</name>
              <description>Description: Specifies the maximum number of DFI clock cycles that the dfi_phyupd_req signal may remain asserted after the assertion of the dfi_phyupd_ack signal for dfi_phyupd_type = 2'b11. The dfi_phyupd_req signal may de-assert at any cycle after the assertion of the dfi_phyupd_ack signal.
Value After Reset: 0x10
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFI_PHYUPD_TYPE2</name>
              <description>Description: Specifies the maximum number of DFI clock cycles that the dfi_phyupd_req signal may remain asserted after the assertion of the dfi_phyupd_ack signal for dfi_phyupd_type = 2'b10. The dfi_phyupd_req signal may de-assert at any cycle after the assertion of the dfi_phyupd_ack signal.
Value After Reset: 0x10
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIMISC</name>
          <description>Description: DFI Miscellaneous Control Register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DFI_INIT_COMPLETE_EN</name>
              <description>Description: PHY initialization complete enable signal. When asserted the dfi_init_complete signal can be used to trigger SDRAM initialisation
Value After Reset: 0x1
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
