RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6880/HPM6880_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>MIPI_DSI_PHY0</name>
      <description>MIPI_DSI_PHY0</description>
      <groupName>MIPI_DSI_PHY</groupName>
      <baseAddress>0xf4140000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x94</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>clane_para0</name>
          <description>timer counter about clock lane parameter</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000050</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>T_RST2ENLPTX_C</name>
              <description>the soft reset of clk_cfg domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>clane_para1</name>
          <description>timer counter about clock lane parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_INITTIME_C</name>
              <description>the number of byteclk cycles that clklane drive LP-11 during initialization period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>clane_para2</name>
          <description>timer counter about clock lane parameter</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00808080</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>T_CLKPREPARE_C</name>
              <description>the number of byteclk cycles that clock lane clkp/n lines are at the hs prepare state lp-00 during a hs clock transmission</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_CLKZERO_C</name>
              <description>the number of byteclk cycles that clock lane clkp/n lines are at the hs-zero state hs-0 during a hs clock transmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_CLKPRE_C</name>
              <description>the number of byteclk cycles that hs clock shall be driven prior to data lane beginning the transition from lp to hs mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>clane_para3</name>
          <description>timer counter about clock lane parameter</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00808080</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>T_CLKPOST_C</name>
              <description>the number of byteclk cycles that the clock lane should keep sending the hs-clock after the last associated data lane has transitioned to LP mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_CLKTRIAL_C</name>
              <description>the number of byteclk cycles that the clock lane clkp/n lines are at state hs-tail sate hs-0 during a hs clock transmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSEXIT_C</name>
              <description>the number of byteclk cycles that the clock lane clkp/n lines are at hs-exit state after a hs clock transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane0_para0</name>
          <description>timer counter about datalane0 parameter</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000050</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>T_RST2ENLPTX_D0</name>
              <description>the number of byteclk cycles that datalane0 wait to enable lptx_en after reset release</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane0_para1</name>
          <description>timer counter about datalane0 parameter</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000014</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_INITTIME_D0</name>
              <description>the number of byteclk cycles that datalane0 drive lp-11 during initiaalization period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane0_para2</name>
          <description>timer counter about datalane0 parameter</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x80808080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_HSPREPARE_D0</name>
              <description>the number of byteclk cycles that the datalane0 stay at hs prepare state lp-00 during a hs transmission</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSZERO_D0</name>
              <description>the number of byteclk cycles that the datalane0 stay at hs-zero sate during a hs transmission</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSTRAIL_D0</name>
              <description>the number of byteclk cycles that the datalane0 stay at hs-trail state during a hs clock transmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSEXIT_D0</name>
              <description>the number of byteclk cycles that the datalane0 stay at state hs-exit sate after a hs clock transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane0_para3</name>
          <description>timer counter about datalane0 parameter</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x00000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_WAKEUP_D0</name>
              <description>the number of byteclk cycles from exiting ultra low power sate to enabling the low-power driver</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane0_para4</name>
          <description>timer counter about datalane0 parameter</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00808080</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>T_TAGO_D0</name>
              <description>the number of byteclk cycles that the tx drives the bridge state during a turnaroud procedure</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_TASURE_D0</name>
              <description>the number of byteclk cycles that the rx waits after a bridge state has been detected during a turnaround procedure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_TAGET_D0</name>
              <description>the number of byteclk cycles that the new transmitter drivers the bridge state after accepting control during bta</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane1_para0</name>
          <description>timer counter about datalane1 parameter</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x00000050</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>T_RST2ENLPTX_D1</name>
              <description>the number of byteclk cycles that datalane1 wait to enable lptx_en after reset release</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane1_para1</name>
          <description>timer counter about datalane1 parameter</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x00000014</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_INITTIME_D1</name>
              <description>the number of byteclk cycles that datalane1 drive lp-11 during initiaalization period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane1_para2</name>
          <description>timer counter about datalane1 parameter</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x80808080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_HSPREPARE_D1</name>
              <description>the number of byteclk cycles that the datalane1 stay at hs prepare state lp-00 during a hs transmission</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSZERO_D1</name>
              <description>the number of byteclk cycles that the datalane1 stay at hs-zero sate during a hs transmission</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSTRAIL_D1</name>
              <description>the number of byteclk cycles that the datalane1 stay at hs-trail state during a hs clock transmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSEXIT_D1</name>
              <description>the number of byteclk cycles that the datalane1 stay at state hs-exit sate after a hs clock transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane1_para3</name>
          <description>timer counter about datalane1 parameter</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_WAKEUP_D1</name>
              <description>the number of byteclk cycles from exiting ultra low power sate to enabling the low-power driver</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane2_para0</name>
          <description>timer counter about datalane2 parameter</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x00000050</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>T_RST2ENLPTX_D2</name>
              <description>the number of byteclk cycles that datalane2 wait to enable lptx_en after reset release</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane2_para1</name>
          <description>timer counter about datalane2 parameter</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000014</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_INITTIME_D2</name>
              <description>the number of byteclk cycles that datalane2 drive lp-11 during initiaalization period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane2_para2</name>
          <description>timer counter about datalane2 parameter</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x80808080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_HSPREPARE_D2</name>
              <description>the number of byteclk cycles that the datalane2 stay at hs prepare state lp-00 during a hs transmission</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSZERO_D2</name>
              <description>the number of byteclk cycles that the datalane2 stay at hs-zero sate during a hs transmission</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSTRAIL_D2</name>
              <description>the number of byteclk cycles that the datalane2 stay at hs-trail state during a hs clock transmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSEXIT_D2</name>
              <description>the number of byteclk cycles that the datalane2 stay at state hs-exit sate after a hs clock transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane2_para3</name>
          <description>timer counter about datalane2 parameter</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x00000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_WAKEUP_D2</name>
              <description>the number of byteclk cycles from exiting ultra low power sate to enabling the low-power driver</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane3_para0</name>
          <description>timer counter about datalane3 parameter</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x00000050</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>T_RST2ENLPTX_D3</name>
              <description>the number of byteclk cycles that datalane3 wait to enable lptx_en after reset release</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane3_para1</name>
          <description>timer counter about datalane3 parameter</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x00000014</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_INITTIME_D3</name>
              <description>the number of byteclk cycles that datalane3 drive lp-11 during initiaalization period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane3_para2</name>
          <description>timer counter about datalane3 parameter</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x80808080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_HSPREPARE_D3</name>
              <description>the number of byteclk cycles that the datalane3 stay at hs prepare state lp-00 during a hs transmission</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSZERO_D3</name>
              <description>the number of byteclk cycles that the datalane3 stay at hs-zero sate during a hs transmission</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSTRAIL_D3</name>
              <description>the number of byteclk cycles that the datalane3 stay at hs-trail state during a hs clock transmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_HSEXIT_D3</name>
              <description>the number of byteclk cycles that the datalane3 stay at state hs-exit sate after a hs clock transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>dlane3_para3</name>
          <description>timer counter about datalane3 parameter</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x00000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_WAKEUP_D3</name>
              <description>the number of byteclk cycles from exiting ultra low power sate to enabling the low-power driver</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>common_para0</name>
          <description>timing parameter for all lanes</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x00000014</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>T_LPX</name>
              <description>the number of byteclk cycles of transmitted length of any low-power state period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
